cask_args appdir: '/Applications'

tap "auth0/auth0-cli"
tap "aws/tap"
tap "common-fate/granted"
tap 'github/gh'
tap 'homebrew/bundle'
tap "oven-sh/bun"
tap "powershell/tap"
tap "simonw/llm"

brew "abseil"
brew "autoconf"
brew "awscli"
brew "biome"
brew "coreutils"
brew "dash-shell"
brew "f2"
brew "gh"
brew "git"
brew "gnu-tar"
brew "grep"
brew "jq"
brew "libassuan"
brew "libgit2"
brew "libgpg-error"
brew "libssh2"
brew "llama.cpp"
brew "llvm"
brew "lsd"
brew "lz4"
brew "m4"
brew "mas"
brew "ollama"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "powerlevel10k"
brew "protobuf"
brew "pyenv"
brew "rust"
brew "tealdeer"
brew "tfenv"
brew "uv"
brew "yarn"
brew "z3"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zstd"
brew "common-fate/granted/granted"
brew "oven-sh/bun/bun"
brew "simonw/llm/ttok"

cask "1password-cli"
cask "audacity"
cask "claude"
cask "claude-code"
cask "chatgpt"
cask "chatgpt-atlas"
cask "disk-drill"
cask "fluor"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "insomnia"
cask "iterm2"
cask "jordanbaird-ice"
cask "kaleidoscope"
cask "keycue"
cask "maccy"
cask "obsidian"
cask "raycast"
cask "session-manager-plugin"
cask "shortcat"
cask "stats"
cask "tower"
cask "typinator"
cask "visual-studio-code"
cask "voiceink"
cask "grandperspective"
cask "github"
cask "linear-linear"
cask "claude"
cask "zed"
cask "zen"
cask "coteditor"
cask "duckduckgo"
cask "google-chrome"
cask "raindropio"
cask "warp"

mas "Actions", id: 1586435171
mas "Battery Indicator", id: 1206020918
mas "Command X", id: 6448461551
mas "Dato", id: 1470584107
mas "Day Progress", id: 6450280202
mas "Floating Clock", id: 1545752052
mas "Lungo", id: 1263070803
mas "MKV2MP4", id: 585396074
mas "Pandan", id: 1569600264
mas "Shareful", id: 1522267256

# Manual installs
# 1Password
# Arc
# Cursor
# Docker
# GitKraken
# Google Chrome
# Google Docs
# Google Drive
# Google Sheets
# Google Slides
# Insomnia
# Loom
# Slack
# Spotify
# Tower
# Visual Studio Code
# zoom.us
